src/mathematics/linear_algebra/KBrefSelfAdjointOperators.org
:PROPERTIES:
:ID:       24100495-22CB-4857-919B-A415C5F09601
:END:
#+TITLE: Self-adjoint operators
* Axler7.11 self-adjoint, Hermitian                                     :def:
  #+begin_quote
  An operator $T \in  \mathcal{L}(V)$ is called /self-adjoint/ if $T = T^*$ aka it is [[id:FC00F818-B37A-4281-9631-4F55FF7FC7ED][adjoint]] to itself. aka: $T \in  \mathcal{L} (V)$ is self-adjoint iff
  \[\begin{aligned}
   \langle Tv, w \rangle = \langle v, Tw \rangle
  \end{aligned}\]
  #+end_quote
  Because adjoint-ness is in some ways analygous to complex conjugation, a self-adjoint operator is somewhat analygous to real numbers (kinda like a number who equals its conjugates real, a map that equals its adjoint is "real")
* results
** Axler7.13 Eigenvalues of self-adjoint operators are real
   #+begin_quote
   Every eigenvalue of a self-adjoint operator is real.
   #+end_quote
** Axler7.14 Over $\mathbb{C}$, only the $0$ operator has $Tv$ being orthogonal to $v$ for all $v$
   For some *complex* vector space $V$ and $T \in  \mathcal{L}(V)$, if
   \[\begin{aligned}
    \langle Tv, v \rangle = 0
   \end{aligned}\]
   for all $v \in  V$, then $T = 0$.
** TODO Axler7.15 and Axler7.16??
** Every self-adjoint operator is [[id:0A7A03F7-22CA-459B-9E2B-850141F2FD28][normal]].
